{"posts":[{"title":"Hello World test","text":"Welcome to Pengzhu Lin Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/project/2024/07/03/hello-world/"}],"tags":[],"categories":[],"pages":[{"title":"about","text":"About MePengzhu LinPhD in Mechanical Enginerring, HKUST Hi there! I’m Pengzhu Lin, a Postdoc in HKUST. I enjoy working on personal projects and exploring new things. Here are more details about me: ProjectsHere are some of the projects I’ve worked on: Hexo Theme Redefine - a customizable and responsive theme for the Hexo blogging platform Particular Icon Pack - a custom icon pack for Android devices Co-creator of the CooflyMC Minecraft Server - a Minecraft server JCSS Unofficial Forum - an unofficial forum for JCSS LinkScape Organization - A non-profit organization official website Cloudflare IP Tester - A simple tool to test which Cloudflare IP is the fastest InterestsWhen I’m not coding, I enjoy: Phigros - a rhythm game that I’m not very good at yet Playing the violin - I’ve been playing for several years Minecraft - I used to play a lot on the Hypixel server, but I don’t play as much anymore now Cities Skylines - a city-building game that I enjoy playing in my free time Coding - I know a little bit of C++ and Python, and I’m comfortable with HTML, CSS, and JavaScript Music - I love listening to pop and electronic music Soccer - I’m a big fan of Lionel Messi Arduino - I’ve played around with Arduino a bit Raspberry Pi - I love using Ubuntu on my Raspberry Pi Solidworks - I know a little bit of Solidworks and enjoy using it for 3D modeling Forza Horizon - I used to play a lot on Xbox","link":"/project/about/index.html"}]}